name: "ensemble"
platform: "ensemble"
max_batch_size: 32
input [
  {
    name: "RAW_IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1 ]
  }
]
output [
  {
    name: "LABEL"
    data_type: TYPE_FP32
    dims: [ 1000 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preprocessing"
      model_version: -1
      input_map {
        key: "DALI_INPUT_0"
        value: "RAW_IMAGE"
      }
      output_map {
        key: "DALI_OUTPUT_0"
        value: "preprocessed_image"
      }
    },
    {
      model_name: "image_clf"
      model_version: -1
      input_map {
        key: "image"
        value: "preprocessed_image"
      }
      output_map {
        key: "label"
        value: "LABEL"
      }
    }
  ]
}